[
    {
        "title": "glyciant.xyz",
        "intro": "My own personal website to introduce myself and show my projects.",
        "status": "Live",
        "start": "November 2018",
        "end": "Present",
        "repo": "https://github.com/Glyciant/MyWebsite",
        "showcase": "https://glyciant.xyz",
        "description": "The aim of this website was to create a landing page for my domain. I wanted to use it to give a brief introduction to myself and what I do, as well as showcasing my projects. It also allows me to direct people to my social media and stuff."
    },
    {
        "title": "Purple+",
        "intro": "A promotion platform designed to give everyone a chance to be recognised for their uniqueness and achievements.",
        "status": "Live",
        "start": "August 2017",
        "end": "Present",
        "repo": "https://github.com/Glyciant/PurplePlus",
        "showcase": "https://purple.plus",
        "description": "This is probably my biggest project to date. Purple+ is a continuation of several systems already in place for the /r/Twitch Subreddit. It allows everyone to make a profile and link their various social media accounts to it. Once this is done, they appear on various Discovery features across the site - including a stream surf option and a TV-guide style page. It also includes Twoos - the subreddit points system."
    },
    {
        "title": "Pusher",
        "intro": "A Reddit mod tool that allows subreddit moderators to see new comments and posts as they come in.",
        "status": "Live",
        "start": "August 2018",
        "end": "Present",
        "repo": "https://github.com/Glyciant/Pusher",
        "showcase": null,
        "description": "This project is to make it easier for subreddit moderators to moderate submissions as they come in. Using notification sounds, Pusher can be left in a pinned tab and just occassionally glanced at whenever it pings. It also allows common mod actions to be carried out directly without needing to go to Reddit. In addition to this, Pusher also shows other moderators who are logged in and how many items are in the subreddit's modqueue."
    },
    {
        "title": "Redirects",
        "intro": "A link redirects system developed for my own personal use.",
        "status": "Live",
        "start": "November 2018",
        "end": "Present",
        "repo": "https://github.com/Glyciant/Redirects",
        "showcase": null,
        "description": "One of the things that I wanted to have when I bought my domain was a link shortening service. I have made something similar in the past, so thought it wouldn't be too much work to make one of my own. I continue to use it on this domain and others."
    }
]